Config/Catalogs/ШаблоныИдентификаторовКвитанцийНаОплатуГосуслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ШаблоныИдентификаторовКвитанцийНаОплатуГосуслуг</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДлинаИдентификатора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставШаблона</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлинаРеквизита</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Символ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФиксированноеПоле</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Перевести16_10</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ШаблоныИдентификаторовКвитанцийНаОплатуГосуслуг/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	ОбразецШаблона = "";
	Для Каждого СтрокаШаблона Из Объект.СоставШаблона Цикл
		Для инд = 1 По СтрокаШаблона.ДлинаРеквизита Цикл
			ОбразецШаблона =  ОбразецШаблона + СтрокаШаблона.Символ;
		КонецЦикла;
	КонецЦикла;
	Элементы.ДекорацияОбразец.Заголовок = ОбразецШаблона;

	ИспользоватьИСРНИП = ПолучитьФункциональнуюОпцию("ИспользоватьИнтеграциюСУНИФО");
	ИспользоватьГИСГМП = ПолучитьФункциональнуюОпцию("ИспользоватьИнтеграциюГИСГМП");
	
	Если НЕ ИспользоватьИСРНИП Тогда
		Элементы.ФормаШаблонИСРНИП.Видимость = Ложь;
		Элементы.ФормаШаблонУНП.Видимость = Ложь;
		Элементы.ФормаШаблонИСРНИП_1_16.Видимость = Ложь;
		Элементы.ФормаШаблонУНП_1_16.Видимость = Ложь;
	КонецЕсли;
	
	Если НЕ ИспользоватьГИСГМП Тогда
		Элементы.ФормаГИСГМП_1_15.Видимость = Ложь;
		Элементы.ФормаГИСГМП_1_16.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Отказ = ПроверитьШаблон();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСоставШаблона

&НаКлиенте
Процедура СоставШаблонаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если Элементы.СоставШаблона.ТекущиеДанные<>Неопределено Тогда
		Элементы.СоставШаблонаЗначение.РедактированиеТекста = Элементы.СоставШаблона.ТекущиеДанные.ФиксированноеПоле;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоставШаблонаЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекСтр = Элементы.СоставШаблона.ТекущиеДанные;
	
	Если НЕ ТекСтр.ФиксированноеПоле Тогда
		
		ВозвращаемаяСтруктура = Неопределено;

		
		ОткрытьФорму("Справочник.ШаблоныИдентификаторовКвитанцийНаОплатуГосуслуг.Форма.ФормаПодбора",,ЭтотОбъект,,,, Новый ОписаниеОповещения("СоставШаблонаЗначениеНачалоВыбораПодбор", ЭтотОбъект, Новый Структура("ТекСтр", ТекСтр)), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
		
		Значение = Элемент.ТекстРедактирования;
		ПоказатьВводСтроки(Новый ОписаниеОповещения("СоставШаблонаЗначениеНачалоВыбораВводСтроки", ЭтотОбъект, Новый Структура("ТекСтр, Значение", ТекСтр, Значение)), Значение, "Введите значение реквизита",, Истина);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СоставШаблонаЗначениеНачалоВыбораВводСтроки(Строка, ДополнительныеПараметры) Экспорт
	
	ТекСтр = ДополнительныеПараметры.ТекСтр;
	
	Значение = ?(Строка = Неопределено, ДополнительныеПараметры.Значение, Строка);
		
	ТекСтр.Значение = Значение;

КонецПроцедуры

&НаКлиенте
Процедура СоставШаблонаЗначениеНачалоВыбораПодбор(Результат, ДополнительныеПараметры) Экспорт
    
    ТекСтр = ДополнительныеПараметры.ТекСтр;
    
    ВозвращаемаяСтруктура = Результат;
    
    Если НЕ ВозвращаемаяСтруктура = Неопределено Тогда
        
        ТекСтр.Значение = ВозвращаемаяСтруктура.Путь;
        
        Если ВозвращаемаяСтруктура.Длина > 0 Тогда
            ТекСтр.ДлинаРеквизита = ВозвращаемаяСтруктура.Длина;
        КонецЕсли;
        
        Если ВозвращаемаяСтруктура.Символ <> "" Тогда
            ТекСтр.Символ = ВозвращаемаяСтруктура.Символ;
        КонецЕсли;
        
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СоставШаблонаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьОбразецШаблона();

КонецПроцедуры

&НаКлиенте
Процедура СоставШаблонаФиксированноеПолеПриИзменении(Элемент)
	ТекСтр = Элементы.СоставШаблона.ТекущиеДанные;
	ТекСтр.Значение = "";
	Элементы.СоставШаблонаЗначение.РедактированиеТекста = Элементы.СоставШаблона.ТекущиеДанные.ФиксированноеПоле;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ШаблонИСРНИП(Команда)
	
	Если Объект.СоставШаблона.Количество()>0 Тогда
		ТекстВопроса = Нстр("ru='Состав шаблона будет перезаполнен. Продолжить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ШаблонИСРНИПЗавершение", ЭтотОбъект), ТекстВопроса,РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
        Возврат;
	КонецЕсли;
	
	ШаблонИСРНИПФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонГИСГМПАдминистраторНачислений(Команда)
	
	Если Объект.СоставШаблона.Количество()>0 Тогда
		ТекстВопроса = Нстр("ru='Состав шаблона будет перезаполнен. Продолжить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ШаблонГИСГМПАдминистраторНачисленийЗавершение", ЭтотОбъект), ТекстВопроса,РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
        Возврат;
	КонецЕсли;
	
	ШаблонГИСГМПАдминистраторНачисленийФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонГИСГМПГлавногоАдминистратора(Команда)
	
	Если Объект.СоставШаблона.Количество()>0 Тогда
		ТекстВопроса = Нстр("ru='Состав шаблона будет перезаполнен. Продолжить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ШаблонГИСГМПГлавногоАдминистратораЗавершение", ЭтотОбъект), ТекстВопроса,РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
        Возврат;
	КонецЕсли;
	
	ШаблонГИСГМПГлавногоАдминистратораФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонУНП(Команда)
	
	Если Объект.СоставШаблона.Количество()>0 Тогда
		ТекстВопроса = Нстр("ru='Состав шаблона будет перезаполнен. Продолжить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ШаблонУНПЗавершение", ЭтотОбъект), ТекстВопроса,РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
        Возврат;
	КонецЕсли;
	
	ШаблонУНПФрагмент();
	
КонецПроцедуры

#Область АвтозаполнениеШаблоновГИСГМП_1_16

&НаКлиенте
Процедура ГИСГМП_1_16_ОрганыГосВласти(Команда)
	
	Если Объект.СоставШаблона.Количество()>0 Тогда
		ТекстВопроса = Нстр("ru='Состав шаблона будет перезаполнен. Продолжить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ГИСГМП_1_16_ОрганыГосВластиЗавершение", ЭтотОбъект), ТекстВопроса,РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
        Возврат;
	КонецЕсли;
	
	ГИСГМП_1_16_ОрганыГосВластиФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ГИСГМП_1_16_ГосУчреждения(Команда)
	
	Если Объект.СоставШаблона.Количество()>0 Тогда
		ТекстВопроса = Нстр("ru='Состав шаблона будет перезаполнен. Продолжить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ГИСГМП_1_16_ГосУчрежденияЗавершение", ЭтотОбъект), ТекстВопроса,РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
        Возврат;
	КонецЕсли;
	
	ГИСГМП_1_16_ГосУчрежденияФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонИСРНИП_1_16(Команда)
	Если Объект.СоставШаблона.Количество()>0 Тогда
		ТекстВопроса = Нстр("ru='Состав шаблона будет перезаполнен. Продолжить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ГИСГМП_1_16_ГосУчрежденияЗавершение", ЭтотОбъект), ТекстВопроса,РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
        Возврат;
	КонецЕсли;
	
	ГИСГМП_1_16_ГосУчрежденияФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ШаблонУНП_1_16(Команда)
	Если Объект.СоставШаблона.Количество()>0 Тогда
		ТекстВопроса = Нстр("ru='Состав шаблона будет перезаполнен. Продолжить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ГИСГМП_1_16_ГосУчрежденияЗавершение", ЭтотОбъект), ТекстВопроса,РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
        Возврат;
	КонецЕсли;
	
	ГИСГМП_1_16_ГосУчрежденияФрагмент();
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиОповещений

&НаКлиенте
Процедура ШаблонИСРНИПЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
    Объект.СоставШаблона.Очистить();
    
    ШаблонИСРНИПФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ШаблонИСРНИПФрагмент()
    
    Перем ИдентификаторСтроки, НовСтр;
    
    Объект.ДлинаИдентификатора = 20;
    
    // Состав шаблона
    //Префикс
    НовСтр = Объект.СоставШаблона.Добавить();
    НовСтр.НаименованиеРеквизита = "Префикс";
    НовСтр.ДлинаРеквизита = 1;
    НовСтр.Символ = "M";
    НовСтр.ФиксированноеПоле = Истина;
    НовСтр.Значение = "M";
    //
    
    //Код системы
    НовСтр = Объект.СоставШаблона.Добавить();
    НовСтр.НаименованиеРеквизита = "Код системы";
    НовСтр.ДлинаРеквизита = 5;
    НовСтр.Символ = "К";
    НовСтр.ФиксированноеПоле = Истина;
    НовСтр.Значение = "<Укажите код>";
    
    ИдентификаторСтроки = НовСтр.ПолучитьИдентификатор();
    //
    
    //Год
    НовСтр = Объект.СоставШаблона.Добавить();
    НовСтр.НаименованиеРеквизита = "Год";
    НовСтр.ДлинаРеквизита = 2;
    НовСтр.Символ = "Г";
    НовСтр.ФиксированноеПоле = Ложь;
    НовСтр.Значение = "ДатаДокумента.Год";
    //
    
    //Номер
    НовСтр = Объект.СоставШаблона.Добавить();
    НовСтр.НаименованиеРеквизита = "Номер";
    НовСтр.ДлинаРеквизита = 11;
    НовСтр.Символ = "Н";
    НовСтр.ФиксированноеПоле = Ложь;
    НовСтр.Значение = "Документ.Номер";
    //
    
    //Контрольный разряд
    НовСтр = Объект.СоставШаблона.Добавить();
    НовСтр.НаименованиеРеквизита = "Контрольный разряд";
    НовСтр.ДлинаРеквизита = 1;
    НовСтр.Символ = "Р";
    НовСтр.ФиксированноеПоле = Ложь;
    НовСтр.Значение = "КонтрольныйРазряд";
    //
    
    ОбновитьОбразецШаблона();
    
    Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
        Объект.Наименование = "Шаблон УИН для "+Строка(Объект.Владелец);
    КонецЕсли;
    
    Элементы.СоставШаблона.ТекущаяСтрока = ИдентификаторСтроки;
    Элементы.СоставШаблона.ТекущийЭлемент = Элементы.СоставШаблонаЗначение;

КонецПроцедуры

&НаКлиенте
Процедура ШаблонГИСГМПАдминистраторНачисленийЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
    Объект.СоставШаблона.Очистить();
    
    ШаблонГИСГМПАдминистраторНачисленийФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ШаблонГИСГМПАдминистраторНачисленийФрагмент()
    
    Перем ИдентификаторСтроки, НовСтр;
    
    Объект.ДлинаИдентификатора = 20;
    
    // Состав шаблона
    //Префикс
    НовСтр = Объект.СоставШаблона.Добавить();
    НовСтр.НаименованиеРеквизита = "Префикс";
    НовСтр.ДлинаРеквизита = 1;
    НовСтр.Символ = "Ъ";
    НовСтр.ФиксированноеПоле = Истина;
    НовСтр.Значение = "Ъ";
    //
    
    //Код системы
    НовСтр = Объект.СоставШаблона.Добавить();
    НовСтр.НаименованиеРеквизита = "Код участника";
    НовСтр.ДлинаРеквизита = 6;
    НовСтр.Символ = "К";
    НовСтр.ФиксированноеПоле = Истина;
    НовСтр.Значение = "<Укажите код участника>";
    
    ИдентификаторСтроки = НовСтр.ПолучитьИдентификатор();
    //
    
    //Год
    НовСтр = Объект.СоставШаблона.Добавить();
    НовСтр.НаименованиеРеквизита = "Год";
    НовСтр.ДлинаРеквизита = 2;
    НовСтр.Символ = "Г";
    НовСтр.ФиксированноеПоле = Ложь;
    НовСтр.Значение = "ДатаДокумента.Год";
    //
    
    //Номер
    НовСтр = Объект.СоставШаблона.Добавить();
    НовСтр.НаименованиеРеквизита = "Номер";
    НовСтр.ДлинаРеквизита = 10;
    НовСтр.Символ = "Н";
    НовСтр.ФиксированноеПоле = Ложь;
    НовСтр.Значение = "Документ.Номер";
    //
    
    //Контрольный разряд
    НовСтр = Объект.СоставШаблона.Добавить();
    НовСтр.НаименованиеРеквизита = "Контрольный разряд";
    НовСтр.ДлинаРеквизита = 1;
    НовСтр.Символ = "Р";
    НовСтр.ФиксированноеПоле = Ложь;
    НовСтр.Значение = "КонтрольныйРазряд";
    //
    
    ОбновитьОбразецШаблона();
    
    Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
        Объект.Наименование = "Шаблон УИН для "+Строка(Объект.Владелец);
    КонецЕсли;
    
    Элементы.СоставШаблона.ТекущаяСтрока = ИдентификаторСтроки;
    Элементы.СоставШаблона.ТекущийЭлемент = Элементы.СоставШаблонаЗначение;

КонецПроцедуры

&НаКлиенте
Процедура ШаблонГИСГМПГлавногоАдминистратораЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
    Объект.СоставШаблона.Очистить();
    
    ШаблонГИСГМПГлавногоАдминистратораФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ШаблонГИСГМПГлавногоАдминистратораФрагмент()
    
    Перем НовСтр;
    
    Объект.ДлинаИдентификатора = 20;
    
    // Состав шаблона
    //Код главы
    НовСтр = Объект.СоставШаблона.Добавить();
    НовСтр.НаименованиеРеквизита = "Код главы";
    НовСтр.ДлинаРеквизита = 3;
    НовСтр.Символ = "П";
    НовСтр.ФиксированноеПоле = Ложь;
    НовСтр.Значение = "Организация.КодПоППП";
    //
    
    //Год
    НовСтр = Объект.СоставШаблона.Добавить();
    НовСтр.НаименованиеРеквизита = "Месяц";
    НовСтр.ДлинаРеквизита = 2;
    НовСтр.Символ = "М";
    НовСтр.ФиксированноеПоле = Ложь;
    НовСтр.Значение = "ДатаДокумента.Месяц";
    //
    
    //Год
    НовСтр = Объект.СоставШаблона.Добавить();
    НовСтр.НаименованиеРеквизита = "Год";
    НовСтр.ДлинаРеквизита = 3;
    НовСтр.Символ = "Г";
    НовСтр.ФиксированноеПоле = Ложь;
    НовСтр.Значение = "ДатаДокумента.Год";
    //
    
    //Номер
    НовСтр = Объект.СоставШаблона.Добавить();
    НовСтр.НаименованиеРеквизита = "Номер";
    НовСтр.ДлинаРеквизита = 11;
    НовСтр.Символ = "Н";
    НовСтр.ФиксированноеПоле = Ложь;
    НовСтр.Значение = "Документ.Номер";
    //
    
    //Контрольный разряд
    НовСтр = Объект.СоставШаблона.Добавить();
    НовСтр.НаименованиеРеквизита = "Контрольный разряд";
    НовСтр.ДлинаРеквизита = 1;
    НовСтр.Символ = "Р";
    НовСтр.ФиксированноеПоле = Ложь;
    НовСтр.Значение = "КонтрольныйРазряд";
    //
    
    ОбновитьОбразецШаблона();
    
    Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
        Объект.Наименование = "Шаблон УИН для "+Строка(Объект.Владелец);
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ШаблонУНПЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;
	
    Объект.СоставШаблона.Очистить();
    
    ШаблонУНПФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ШаблонУНПФрагмент()
    
    Перем ИдентификаторСтроки, НовСтр;
    
    Объект.ДлинаИдентификатора = 20;
    
    // Состав шаблона
    //Префикс
    НовСтр = Объект.СоставШаблона.Добавить();
    НовСтр.НаименованиеРеквизита = "Префикс";
    НовСтр.ДлинаРеквизита = 1;
    НовСтр.Символ = "M";
    НовСтр.ФиксированноеПоле = Истина;
    НовСтр.Значение = "Ъ";
    //
    
    //Код системы
    НовСтр = Объект.СоставШаблона.Добавить();
    НовСтр.НаименованиеРеквизита = "Код участника в ГИС ГМП";
    НовСтр.ДлинаРеквизита = 6;
    НовСтр.Символ = "К";
    НовСтр.ФиксированноеПоле = Истина;
    НовСтр.Значение = "<Укажите код>";
    
    ИдентификаторСтроки = НовСтр.ПолучитьИдентификатор();
    //
    
    //Год
    НовСтр = Объект.СоставШаблона.Добавить();
    НовСтр.НаименованиеРеквизита = "Год";
    НовСтр.ДлинаРеквизита = 2;
    НовСтр.Символ = "Г";
    НовСтр.ФиксированноеПоле = Ложь;
    НовСтр.Значение = "ДатаДокумента.Год";
    //
    
    //Номер
    НовСтр = Объект.СоставШаблона.Добавить();
    НовСтр.НаименованиеРеквизита = "Номер";
    НовСтр.ДлинаРеквизита = 10;
    НовСтр.Символ = "Н";
    НовСтр.ФиксированноеПоле = Ложь;
    НовСтр.Значение = "Документ.Номер";
    //
    
    //Контрольный разряд
    НовСтр = Объект.СоставШаблона.Добавить();
    НовСтр.НаименованиеРеквизита = "Контрольный разряд";
    НовСтр.ДлинаРеквизита = 1;
    НовСтр.Символ = "Р";
    НовСтр.ФиксированноеПоле = Ложь;
    НовСтр.Значение = "КонтрольныйРазряд";
    //
    
    ОбновитьОбразецШаблона();
    
    Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
        Объект.Наименование = "Шаблон УИН для "+Строка(Объект.Владелец);
    КонецЕсли;
    
    Элементы.СоставШаблона.ТекущаяСтрока = ИдентификаторСтроки;
    Элементы.СоставШаблона.ТекущийЭлемент = Элементы.СоставШаблонаЗначение;
    
КонецПроцедуры


#Область АвтозаполнениеШаблоновГИСГМП_1_16

&НаКлиенте
Процедура ГИСГМП_1_16_ОрганыГосВластиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
    Объект.СоставШаблона.Очистить();
    
    ГИСГМП_1_16_ОрганыГосВластиФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ГИСГМП_1_16_ОрганыГосВластиФрагмент()
    
    Перем НовСтр;
    
    Объект.ДлинаИдентификатора = 20;
    
    // Состав шаблона
    //Код главы
    НовСтр = Объект.СоставШаблона.Добавить();
    НовСтр.НаименованиеРеквизита = "Код главы";
    НовСтр.ДлинаРеквизита = 3;
    НовСтр.Символ = "П";
    НовСтр.ФиксированноеПоле = Ложь;
    НовСтр.Значение = "Организация.КодПоППП";
    //
	
	//УРН
    НовСтр = Объект.СоставШаблона.Добавить();
    НовСтр.НаименованиеРеквизита = "Код участника";
    НовСтр.ДлинаРеквизита = 8;
    НовСтр.Символ = "У";
    НовСтр.ФиксированноеПоле = Истина;
	НовСтр.Перевести16_10 = Истина;
    НовСтр.Значение = "<Укажите 6 символьный код участника>";
    //
	
    //Год
    НовСтр = Объект.СоставШаблона.Добавить();
    НовСтр.НаименованиеРеквизита = "Год";
    НовСтр.ДлинаРеквизита = 2;
    НовСтр.Символ = "Г";
    НовСтр.ФиксированноеПоле = Ложь;
    НовСтр.Значение = "ДатаДокумента.Год";
    //
    
    //Номер
    НовСтр = Объект.СоставШаблона.Добавить();
    НовСтр.НаименованиеРеквизита = "Номер";
    НовСтр.ДлинаРеквизита = 6;
    НовСтр.Символ = "Н";
    НовСтр.ФиксированноеПоле = Ложь;
    НовСтр.Значение = "Документ.Номер";
    //
    
    //Контрольный разряд
    НовСтр = Объект.СоставШаблона.Добавить();
    НовСтр.НаименованиеРеквизита = "Контрольный разряд формата 1.16";
    НовСтр.ДлинаРеквизита = 1;
    НовСтр.Символ = "Р";
    НовСтр.ФиксированноеПоле = Ложь;
    НовСтр.Значение = "КонтрольныйРазряд_1_16";
    //
    
    ОбновитьОбразецШаблона();
    
    Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
        Объект.Наименование = "Шаблон УИН формата 1.16/2.0/2.1 для "+Строка(Объект.Владелец);
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ГИСГМП_1_16_ГосУчрежденияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
    Объект.СоставШаблона.Очистить();
    
    ГИСГМП_1_16_ГосУчрежденияФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ГИСГМП_1_16_ГосУчрежденияФрагмент()
    
    Перем НовСтр;
    
    Объект.ДлинаИдентификатора = 25;
    
    // Состав шаблона
	
	//УРН
    НовСтр = Объект.СоставШаблона.Добавить();
    НовСтр.НаименованиеРеквизита = "Код участника";
    НовСтр.ДлинаРеквизита = 8;
    НовСтр.Символ = "У";
    НовСтр.ФиксированноеПоле = Истина;
	НовСтр.Перевести16_10 = Истина;
    НовСтр.Значение = "<Укажите 6 символьный код участника>";
    //
	
    //Год
    НовСтр = Объект.СоставШаблона.Добавить();
    НовСтр.НаименованиеРеквизита = "Год";
    НовСтр.ДлинаРеквизита = 3;
    НовСтр.Символ = "Г";
    НовСтр.ФиксированноеПоле = Ложь;
    НовСтр.Значение = "ДатаДокумента.Год";
    //
	
	//Год
    НовСтр = Объект.СоставШаблона.Добавить();
    НовСтр.НаименованиеРеквизита = "Месяц";
    НовСтр.ДлинаРеквизита = 2;
    НовСтр.Символ = "М";
    НовСтр.ФиксированноеПоле = Ложь;
    НовСтр.Значение = "ДатаДокумента.Месяц";
    //
    
    //Номер
    НовСтр = Объект.СоставШаблона.Добавить();
    НовСтр.НаименованиеРеквизита = "Номер";
    НовСтр.ДлинаРеквизита = 11;
    НовСтр.Символ = "Н";
    НовСтр.ФиксированноеПоле = Ложь;
    НовСтр.Значение = "Документ.Номер";
    //
    
    //Контрольный разряд
    НовСтр = Объект.СоставШаблона.Добавить();
    НовСтр.НаименованиеРеквизита = "Контрольный разряд формата 1.16";
    НовСтр.ДлинаРеквизита = 1;
    НовСтр.Символ = "Р";
    НовСтр.ФиксированноеПоле = Ложь;
    НовСтр.Значение = "КонтрольныйРазряд_1_16";
    //
    
    ОбновитьОбразецШаблона();
    
    Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
        Объект.Наименование = "Шаблон УИН формата 1.16/2.0/2.1 для "+Строка(Объект.Владелец);
    КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

&НаКлиенте
Процедура ОбновитьОбразецШаблона()
	
	ОбразецШаблона = "";
	Для Каждого СтрокаШаблона Из Объект.СоставШаблона Цикл
		Для инд = 1 По СтрокаШаблона.ДлинаРеквизита Цикл
			ОбразецШаблона =  ОбразецШаблона + СтрокаШаблона.Символ;
		КонецЦикла;
	КонецЦикла;
	Элементы.ДекорацияОбразец.Заголовок = ОбразецШаблона;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьШаблон()
	Отказ = Ложь;
	ИтогТЧ = Объект.СоставШаблона.Итог("ДлинаРеквизита");
	Если ИтогТЧ<>Объект.ДлинаИдентификатора Тогда
		ТекстСообщения = НСтр("ru='Длина шаблона в табличной части = %1 не соответствует заданной длине идентификатора = %2. Запись не выполнена!'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,ИтогТЧ,Объект.ДлинаИдентификатора);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,Объект.Ссылка,"Объект.СоставШаблона");
		Отказ = Истина;	
	КонецЕсли;
	Возврат Отказ;
КонецФункции

&НаКлиенте
Процедура Проверить(Команда)
	НайденПризнак = Ложь;	
	Для Каждого СтрТЧ Из Объект.СоставШаблона Цикл
		Если СтрТЧ.Значение = "КонтрольныйРазряд" Тогда
			НайденПризнак = Истина;
			//Шаблон предназначен для форматов 1.15
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru='Данный шаблон предназначен для формирования уникального идентификатора начисления по формату 1.15.'"));
			Прервать;
		ИначеЕсли СтрТЧ.Значение = "КонтрольныйРазряд_1_16" Тогда
			НайденПризнак = Истина;
			//Шаблон предназначен для форматов 1.16
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru='Данный шаблон предназначен для формирования уникального идентификатора начисления по форматам 1.16 и 2.0/2.1.'"));
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ НайденПризнак Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru='Данный шаблон НЕ содержит формирование контрольного разряда ни по формату 1.15, ни по формату 1.16/2.0/2.1.'"));		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
